# parameters
nc: 1  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
    #  - [30,61, 62,45, 59,119]  # P4/16
    #  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, nn.Conv2d, [3, 16, 2]],   # 320
   [-1, 1, Block, [3, 16, 16, 16, 0, 16, 2]],   #kernel_size, c_in, expand_size, c_out, is_hswish, attention, stride 
   [-1, 1, Block, [3, 16, 72, 24, 0, 0, 2]],    # 80
   [-1, 1, Block, [3, 24, 88, 24, 0, 0, 1]],    
   [-1, 1, Block, [5, 24, 96, 40, 1, 40, 2]],   # 40
   [-1, 1, Block, [5, 40, 240, 40, 1, 40, 1]],
   [-1, 1, Block, [5, 40, 240, 40, 1, 40, 1]],
   [-1, 1, Block, [5, 40, 120, 48, 1, 48, 1]],   
   [-1, 1, Block, [5, 48, 144, 48, 1, 48, 1]],
   [-1, 1, Block, [5, 48, 288, 96, 1, 96, 2]],  # 20
   [-1, 1, Block, [5, 96, 576, 96, 1, 96, 1]],
   [-1, 1, Block, [5, 96, 576, 96, 1, 96, 1]],
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 7], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, ECAC3, [512, False]],  # 13

   #[-1, 1, Conv, [256, 1, 1]],
   #[-1, 1, nn.Upsample, [None, 2, 'nearest']],
   #[[-1, 4], 1, Concat, [1]],  # cat backbone P3
   #[-1, 3, ECAC3, [256, False]],  # 17 (P3/8-small)

   #[-1, 1, Conv, [256, 3, 2]],
   #[[-1, 14], 1, Concat, [1]],  # cat head P4
   #[-1, 3, ECAC3, [512, False]],  # 20 (P4/16-medium)

   #[-1, 1, Conv, [512, 3, 2]],
   #[[-1, 10], 1, Concat, [1]],  # cat head P5
   #[-1, 3, ECAC3, [1024, False]],  # 23 (P5/32-large)

   #[[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
   [[-1], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
